In [1]:
#pandas入门
from pandas import Series,DataFrame
import pandas as pd

In [2]:
#pandas的数据结构介绍
#Series
obj = Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4,7,-5,3], index = ['d','b','a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [9]:
obj2['a']

-5

In [11]:
obj2['d']=6

In [12]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

NameError: name 'np' is not defined

In [17]:
import numpy as np

In [18]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [20]:
'b' in obj2

True

In [21]:
'e' in obj2

False

In [22]:
6 in obj2

False

In [23]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [24]:
obj3=Series(sdata)

In [25]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
states=['California','Ohio','Oregon','Texas']
obj4 = Series(sdata,index=states)

In [27]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [28]:
#检测缺失值
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [29]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [30]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [31]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [32]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [33]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [34]:
obj4.name="populartion"

In [35]:
obj4.index.name="state"

In [36]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: populartion, dtype: float64

In [37]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [38]:
obj.index=['Bob','Steve','Jeff','Ryan']

In [39]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [40]:
#DataFrame
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'opo':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)

In [41]:
frame

   opo   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [43]:
DataFrame(data,columns=['year','state','opo'])

   year   state  opo
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [44]:
frame2=DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])

In [45]:
frame2

       year   state  pop debt
one    2000    Ohio  NaN  NaN
two    2001    Ohio  NaN  NaN
three  2002    Ohio  NaN  NaN
four   2001  Nevada  NaN  NaN
five   2002  Nevada  NaN  NaN

In [46]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [47]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [48]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [49]:
frame2['year']['one']

2000

In [50]:
frame2.year.two

2001

In [51]:
frame2

       year   state  pop debt
one    2000    Ohio  NaN  NaN
two    2001    Ohio  NaN  NaN
three  2002    Ohio  NaN  NaN
four   2001  Nevada  NaN  NaN
five   2002  Nevada  NaN  NaN

In [53]:
frame2.ix['three']

year     2002
state    Ohio
pop       NaN
debt      NaN
Name: three, dtype: object

In [54]:
frame2['debt']=16.5

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  NaN  16.5
two    2001    Ohio  NaN  16.5
three  2002    Ohio  NaN  16.5
four   2001  Nevada  NaN  16.5
five   2002  Nevada  NaN  16.5

In [56]:
frame2['debt']=np.arange(5)

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  NaN     0
two    2001    Ohio  NaN     1
three  2002    Ohio  NaN     2
four   2001  Nevada  NaN     3
five   2002  Nevada  NaN     4

In [58]:
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [59]:
frame2['debt']=val

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  NaN   NaN
two    2001    Ohio  NaN  -1.2
three  2002    Ohio  NaN   NaN
four   2001  Nevada  NaN  -1.5
five   2002  Nevada  NaN  -1.7

In [61]:
frame2['eastern']=frame2.state=='Ohio'

In [62]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  NaN   NaN    True
two    2001    Ohio  NaN  -1.2    True
three  2002    Ohio  NaN   NaN    True
four   2001  Nevada  NaN  -1.5   False
five   2002  Nevada  NaN  -1.7   False

In [63]:
del frame2['eastern']

In [65]:
frame2

       year   state  pop  debt
one    2000    Ohio  NaN   NaN
two    2001    Ohio  NaN  -1.2
three  2002    Ohio  NaN   NaN
four   2001  Nevada  NaN  -1.5
five   2002  Nevada  NaN  -1.7

In [66]:
#字典嵌套字典
pop={'Nevada':{2001:2.4,2002:2.9},
    'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [67]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [68]:
frame3=DataFrame(pop)

In [69]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [70]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [71]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [72]:
pdata={'Ohio':frame3['Ohio'][:-1],
      'Nevada':frame3['Nevada'][:2]}

In [73]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [74]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [75]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [76]:
frame3.index.name='year'

In [77]:
frame3

      Nevada  Ohio
year
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [78]:
frame3.columns.name='state'

In [79]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [81]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [82]:
frame2.values

array([[2000L, 'Ohio', nan, nan],
       [2001L, 'Ohio', nan, -1.2],
       [2002L, 'Ohio', nan, nan],
       [2001L, 'Nevada', nan, -1.5],
       [2002L, 'Nevada', nan, -1.7]], dtype=object)

In [83]:
#索引对象
obj=Series(range(3),index=['a','b','3'])

In [84]:
index = obj.index

In [85]:
index

Index([u'a', u'b', u'3'], dtype='object')

In [86]:
index[1:]

Index([u'b', u'3'], dtype='object')

In [87]:
index[1]='d'

TypeError: Index does not support mutable operations

In [88]:
index = pd.Index(np.arange(3))

In [89]:
index

Int64Index([0, 1, 2], dtype='int64')

In [90]:
obj2=Series([1.5,-2.5,0],index=index)

In [91]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [92]:
obj2.index is index

True

In [93]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [95]:
'Ohio' in frame3.columns

True

In [96]:
2003 in frame3.index

False

In [ ]:
#基本功能

In [101]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [102]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [104]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [105]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [106]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [107]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [108]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [109]:
obj3.reindex(range(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [110]:
obj3.reindex(range(6),method="pad")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [111]:
obj3.reindex(range(6),method="bfill")

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [116]:
frame=DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [117]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [118]:
frame2=frame.reindex(['a','b','c','d'])

In [119]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [120]:
states = ['Texas','Utah','California']

In [121]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [122]:
frame.reindex(index=['a','b','c','d'],method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [123]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [124]:
#丢弃指定轴上的项

In [125]:
obj=Series(np.arange(5.),index=['a','b','c','d','e'])

In [126]:
new_obj = obj.drop('c')

In [127]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [128]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [129]:
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [130]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [131]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [132]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [133]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [134]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [136]:
data[data<5]=0

In [137]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [139]:
data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [140]:
data.ix[['Colorado','Utah'],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [141]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [143]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [144]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data.ix[data.three>5,:3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [146]:
#算数运算和数据对齐

In [147]:
s1=Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [148]:
s2=Series([-2.4,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [149]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [150]:
s2

a   -2.4
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [151]:
s1+s2

a    4.9
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [1]:
df1=DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

NameError: name 'DataFrame' is not defined

In [2]:
import pandas as pd

In [3]:
df1=DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

NameError: name 'DataFrame' is not defined

In [4]:
from pandas import Series,DataFrame
import pandas as pd

In [5]:
df1=DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

NameError: name 'np' is not defined

In [6]:
import numpy as np

In [7]:
df1=DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])

In [8]:
df2=DataFrame(np.arange(12).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [9]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [10]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [11]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [12]:
df1=DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))

In [13]:
df2=DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))

In [14]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [15]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [16]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [17]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [18]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [19]:
#DataFrame与Series之间的运算
arr=np.arange(12.).reshape((3,4))

In [20]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [21]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [22]:
arr-arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [24]:
frame=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [25]:
series=frame.ix[0]

In [26]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [27]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [28]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [29]:
series2=Series(range(3),index=['b','e','f'])

In [30]:
series2

b    0
e    1
f    2
dtype: int64

In [31]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [32]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [33]:
series3=frame['d']

In [34]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [35]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [36]:
frame.sub(series3,axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [37]:
#函数应用和映射

In [38]:
frame=DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [39]:
frame

               b         d         e
Utah    1.306012  0.093641 -1.157712
Ohio   -0.640436 -1.629721 -1.701093
Texas   1.505876 -2.490701 -0.431622
Oregon -0.080110  0.520525  0.848957

In [40]:
np.abs(frame)

               b         d         e
Utah    1.306012  0.093641  1.157712
Ohio    0.640436  1.629721  1.701093
Texas   1.505876  2.490701  0.431622
Oregon  0.080110  0.520525  0.848957

In [41]:
f = lambda x:x.max()-x.min()

In [42]:
frame.apply(f)

b    2.146311
d    3.011226
e    2.550050
dtype: float64

In [43]:
frame

               b         d         e
Utah    1.306012  0.093641 -1.157712
Ohio   -0.640436 -1.629721 -1.701093
Texas   1.505876 -2.490701 -0.431622
Oregon -0.080110  0.520525  0.848957

In [44]:
frame.apply(f,axis=1)

Utah      2.463725
Ohio      1.060657
Texas     3.996576
Oregon    0.929067
dtype: float64

In [45]:
frame

               b         d         e
Utah    1.306012  0.093641 -1.157712
Ohio   -0.640436 -1.629721 -1.701093
Texas   1.505876 -2.490701 -0.431622
Oregon -0.080110  0.520525  0.848957

In [47]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])

In [48]:
frame.apply(f)

            b         d         e
min -0.640436 -2.490701 -1.701093
max  1.505876  0.520525  0.848957

In [49]:
frame

               b         d         e
Utah    1.306012  0.093641 -1.157712
Ohio   -0.640436 -1.629721 -1.701093
Texas   1.505876 -2.490701 -0.431622
Oregon -0.080110  0.520525  0.848957

In [50]:
format = lambda x: '%.2f' % x

In [51]:
frame.applymap(format)

            b      d      e
Utah     1.31   0.09  -1.16
Ohio    -0.64  -1.63  -1.70
Texas    1.51  -2.49  -0.43
Oregon  -0.08   0.52   0.85

In [52]:
frame['e'].map(format)

Utah      -1.16
Ohio      -1.70
Texas     -0.43
Oregon     0.85
Name: e, dtype: object

In [53]:
#排序和排名

In [54]:
obj=Series(range(4),index=list('dabc'))

In [55]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [56]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [57]:
frame=DataFrame(np.arange(8).reshape((2,4)),index=['three','obe'],columns=list('dabc'))

In [58]:
frame

       d  a  b  c
three  0  1  2  3
obe    4  5  6  7

In [59]:
frame.sort_index()

       d  a  b  c
obe    4  5  6  7
three  0  1  2  3

In [60]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
obe    5  6  7  4

In [61]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
obe    4  7  6  5

In [62]:
obj=Series([4,7,-3,2])

In [63]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [64]:
obj.order()

D:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

2   -3
3    2
0    4
1    7
dtype: int64

In [65]:
obj=Series([4,np.nan,7,np.nan,-3,2])

In [66]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [67]:
obj.order()

D:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [70]:
frame=DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [71]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [73]:
frame.sort_index(by='b',ascending=False)

D:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
1  1  7
0  0  4
3  1  2
2  0 -3

In [74]:
frame.sort_index(by=['a','b'])

D:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [75]:
#排名
obj=Series([7,-5,7,4,2,0,4])

In [76]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [78]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [79]:
obj.rank(method='max',ascending=False)

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [80]:
frame=DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [81]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [82]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [83]:
#带有重复值的轴索引

In [84]:
obj=Series(range(5),index=['a','a','b','b','c'])

In [85]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [86]:
obj.index.is_unique

False

In [87]:
obj['a']

a    0
a    1
dtype: int64

In [88]:
obj['c']

4

In [89]:
df=DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [90]:
df

          0         1         2
a  0.130483  1.471963 -0.730023
a  0.879628 -1.004388  0.989933
b -1.103273  0.983112  1.122914
b -0.098704  1.127251  0.914879

In [91]:
df.ix['b']

          0         1         2
b -1.103273  0.983112  1.122914
b -0.098704  1.127251  0.914879

In [92]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [93]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [94]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [95]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [96]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [97]:
df.idxmax()

one    b
two    d
dtype: object

In [98]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [99]:
df.describe()

D:\Anaconda2\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.300000

In [100]:
#相关系数与协方差

In [101]:
import pandas.io.data as web

D:\Anaconda2\lib\site-packages\pandas\io\data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [102]:
all_data={}

In [103]:
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker]=web.get_data_yahoo(ticker,'1/1/2000','1/1/2000','1/1/2010')
    
price = DataFrame({tic:data['Adj Close']
                  for tic,data in all_data.iteritems()})
volume = DataFrame({tic:data['Volume']
                   for tic, data in all_data.iteritems()})

TypeError: an integer is required

In [104]:
#唯一值、值计数以及成员资格

In [105]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [106]:
uniques = obj.unique()

In [107]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [108]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [109]:
pd.value_counts(obj.values,sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [110]:
mask = obj.isin(['b','c'])

In [111]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [112]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [113]:
data = DataFrame({'Qu1':[1,3,4,3,4],
                 'Qu2':[2,3,1,2,3],
                 'Qu3':[1,5,2,4,4]})

In [114]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [115]:
result = data.apply(pd.value_counts).fillna(0)

In [116]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [117]:
  #处理缺失值

In [118]:
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])

In [119]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [120]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [121]:
string_data[0]=None

In [122]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [123]:
#滤除缺失数据

In [124]:
from numpy import nan as NA

In [125]:
data = Series([1,NA,3.5,NA,7])

In [126]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [127]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [128]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [129]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [130]:
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [131]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [132]:
cleaned = data.dropna()

In [133]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [135]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [136]:
data[4]=NA

In [137]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [138]:
data.dropna(axis=1,how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [139]:
df = DataFrame(np.random.randn(7,3))

In [140]:
df

          0         1         2
0 -2.286665  0.152686  0.103479
1  1.069225 -1.814657 -0.415422
2 -0.953500 -0.353203  0.137565
3  0.202446 -0.729816  0.263463
4  0.311472  0.779882 -0.165068
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [141]:
df.ix[:4,1]=NA;
df.ix[:2,2]=NA

In [142]:
df

          0         1         2
0 -2.286665       NaN       NaN
1  1.069225       NaN       NaN
2 -0.953500       NaN       NaN
3  0.202446       NaN  0.263463
4  0.311472       NaN -0.165068
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [143]:
df.dropna(thresh=3)

          0         1         2
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [144]:
df

          0         1         2
0 -2.286665       NaN       NaN
1  1.069225       NaN       NaN
2 -0.953500       NaN       NaN
3  0.202446       NaN  0.263463
4  0.311472       NaN -0.165068
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [145]:
df.fillna(0)

          0         1         2
0 -2.286665  0.000000  0.000000
1  1.069225  0.000000  0.000000
2 -0.953500  0.000000  0.000000
3  0.202446  0.000000  0.263463
4  0.311472  0.000000 -0.165068
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [146]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -2.286665  0.500000       NaN
1  1.069225  0.500000       NaN
2 -0.953500  0.500000       NaN
3  0.202446  0.500000  0.263463
4  0.311472  0.500000 -0.165068
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [147]:
df

          0         1         2
0 -2.286665       NaN       NaN
1  1.069225       NaN       NaN
2 -0.953500       NaN       NaN
3  0.202446       NaN  0.263463
4  0.311472       NaN -0.165068
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [148]:
_ = df.fillna(0,inplace=True)

In [149]:
df

          0         1         2
0 -2.286665  0.000000  0.000000
1  1.069225  0.000000  0.000000
2 -0.953500  0.000000  0.000000
3  0.202446  0.000000  0.263463
4  0.311472  0.000000 -0.165068
5 -0.907550 -0.791883 -1.637389
6 -1.119026 -0.033628 -0.861492

In [150]:
df = DataFrame(np.random.randn(6,3))

In [151]:
df

          0         1         2
0  1.196494 -0.986914 -0.642383
1 -0.307044 -0.112460 -0.766910
2 -0.224198  0.487332 -2.056152
3  0.164783 -0.847785 -0.326596
4 -1.525230  0.166262  0.508354
5  0.172686 -0.705520 -0.196446

In [153]:
df.ix[2:,1] = NA

In [154]:
df

          0         1         2
0  1.196494 -0.986914 -0.642383
1 -0.307044 -0.112460 -0.766910
2 -0.224198       NaN -2.056152
3  0.164783       NaN -0.326596
4 -1.525230       NaN  0.508354
5  0.172686       NaN -0.196446

In [155]:
df.ix[4:,2]=NA

In [156]:
df

          0         1         2
0  1.196494 -0.986914 -0.642383
1 -0.307044 -0.112460 -0.766910
2 -0.224198       NaN -2.056152
3  0.164783       NaN -0.326596
4 -1.525230       NaN       NaN
5  0.172686       NaN       NaN

In [157]:
df.fillna(method='ffill')

          0         1         2
0  1.196494 -0.986914 -0.642383
1 -0.307044 -0.112460 -0.766910
2 -0.224198 -0.112460 -2.056152
3  0.164783 -0.112460 -0.326596
4 -1.525230 -0.112460 -0.326596
5  0.172686 -0.112460 -0.326596

In [158]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  1.196494 -0.986914 -0.642383
1 -0.307044 -0.112460 -0.766910
2 -0.224198 -0.112460 -2.056152
3  0.164783 -0.112460 -0.326596
4 -1.525230       NaN -0.326596
5  0.172686       NaN -0.326596

In [159]:
data=Series([1.,NA,3.5,NA,7])

In [160]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [161]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [162]:
#层次化索引

In [163]:
data=Series(np.random.randn(10), 
           index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])

In [164]:
data

a  1    1.517792
   2    1.732112
   3    0.256928
b  1    1.469863
   2    0.061318
   3   -0.279325
c  1    0.511045
   2   -0.159592
d  2    0.169578
   3   -0.798009
dtype: float64

In [165]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [166]:
data['b']

1    1.469863
2    0.061318
3   -0.279325
dtype: float64

In [167]:
data['b':'c']

b  1    1.469863
   2    0.061318
   3   -0.279325
c  1    0.511045
   2   -0.159592
dtype: float64

In [168]:
data.ix[['b','d']]

b  1    1.469863
   2    0.061318
   3   -0.279325
d  2    0.169578
   3   -0.798009
dtype: float64

In [169]:
data[:,2]

a    1.732112
b    0.061318
c   -0.159592
d    0.169578
dtype: float64

In [170]:
data.unstack()

          1         2         3
a  1.517792  1.732112  0.256928
b  1.469863  0.061318 -0.279325
c  0.511045 -0.159592       NaN
d       NaN  0.169578 -0.798009

In [171]:
data.unstack().stack()

a  1    1.517792
   2    1.732112
   3    0.256928
b  1    1.469863
   2    0.061318
   3   -0.279325
c  1    0.511045
   2   -0.159592
d  2    0.169578
   3   -0.798009
dtype: float64

In [172]:
frame=DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [173]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [175]:
frame.index.names=['key1','key2']

In [176]:
frame.columns.names = ['state','color']

In [177]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [178]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [179]:
MultiIndex.frome_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names=['state','color'])

NameError: name 'MultiIndex' is not defined

In [180]:
#重排分级顺序

In [181]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [182]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [183]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [184]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [185]:
#根据级别汇总统计

In [186]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [187]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [188]:
#使用DataFrame的列

In [192]:
frame=DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})

In [193]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [196]:
frame.index.values

array([0, 1, 2, 3, 4, 5, 6], dtype=int64)

In [197]:
frame2=frame.set_index(['c','d'])

In [198]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [199]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [200]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1